Revit 2027 API
StairsRunType.RiserThickness Property
 The thickness of the risers.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RiserThickness { get; set; }
Public Property RiserThickness As Double
	Get
	Set
public:
property double RiserThickness {
	double get ();
	void set (double value);
}
member RiserThickness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for length must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property: The run type has no riser so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace